<template>
  <div class="row" style="margin-top: 3vw">
    <div class="col-md-12">
      <p :key="paragraph.id" v-for="paragraph of paragraphs_to_show">{{ paragraph }}</p>
    </div>

    <div class="row" style="text-align: center; background: none">
      <div class="col-md-12">
        <button v-on:click="curr_page--" :disabled="has_previos_page" class="btn">←</button>
        -
        <button v-on:click="curr_page++" :disabled="has_next_page" class="btn">→</button>
      </div>
    </div>
  </div>
</template>

<script>
    export default {
        name: "InfoBlock",
        data() {
          return {
            paragraphs: [
              "При проектировании причальных набережных, пирсов, молов и других объектов гидротехнического строительства находят применение оболочки большого диаметра, занимающие промежуточное положение между защемленными в грунт тонкими стенками и массивными гравитационными сооружениями. Конструкция заполненной оболочки представляет собой тонкую оболочку (выполненную, как правило, из стали или железобетона) с внутренним наполнителем, в качестве которого используется грунт с заданными физическими и прочностными характеристиками. Отношение диаметра D к высоте конструкции H определяет группу оболочек большого диаметра, для которых указанное соотношение D/H находится в диапазоне от 0,7 до 1,0.",
              "В настоящее время в связи с необходимостью освоения шельфовых месторождений углеводородов возникает задача расширения мощностей портов и возведения новых объектов прибрежной инфраструктуры. В условиях сравнительно слабых сжимаемых грунтов основания шельфовой зоны арктических морей, устройство специально подготовленных каменных постелей затруднено, а производство и транспортировка массивных железобетонных конструкций невозможны ввиду удалённости объекта. В указанных условиях стальные оболочки большого диаметра, частично заглублённые в грунт основания, имеют значительные преимущества перед другими видами несущих конструкций.",
              "Для оценки напряжённо-деформированного состояния цилиндрической оболочки с наполнителем, установленной на сжимаемом грунтовом основании, была разработана теоретическая модель оценки устойчивости грунтовых оснований оболочечных гравитационных сооружений.",
              "Разрабатываемая теоретическая модель оценки устойчивости грунтовых оснований рассматриваемых сооружений, основана на решении задачи о предельном напряжённом состоянии грунтового основания, с учётом развития полей скольжения. Исходя из предельной несущей способности основания, определяется предельная нагрузка на оболочку, при которой система «оболочка-основание» сохраняет состояние равновесия. Предложенная зависимость представляет собой теоретическую модель, функционально связывающую параметры грунта основания и размеры сооружения с максимальной горизонтальной силой, которую сооружение воспринимает без потери несущей способности основания.\n\tМодель позволяет осуществить быстрый предварительный подбор характеристик основания при заданных габаритах сооружения из условия сохранения несущей способности грунта."
            ],
            curr_page: 0
          }
        },
      computed: {
          paragraphs_to_show: function () {
            return this.paragraphs.slice(this.curr_page * 2, (this.curr_page * 2) + 2);
          },
          has_next_page: function () {
            return (this.curr_page + 1 >= this.paragraphs.length / 2);
          },
          has_previos_page: function () {
            return this.curr_page === 0;
          }
      }
    }
</script>

<style scoped>
  .row {
    margin-top: 3vw;
    text-align: justify;
  }
  p {
    text-indent: 6vh;
    font-size: 2vh;
  }
</style>
