<template>
  <section class="base-container">
    <div class="container">
      <H1 style="text-align: center; font-size: 2.5vh">МЕТОД РАСЧЕТА ПРЕДЕЛЬНЫХ НАГРУЗОК НА СООРУЖЕНИЯ
        ИЗ ЗАПОЛНЕННЫХ ЦИЛИНДРИЧЕСКИХ ОБОЛОЧЕК</H1>
      <div class="row" style="margin-top: 3vw">
        <div class="col-md-12">
          <p>
              При проектировании подпорных сооружений, удерживающих грунт от обрушения (в
            промышленном и гражданском строительстве), возведении эстакад и устоев мостов (в транспортном
            строительстве), строительстве причальных набережных, пирсов, молов и других объектов
            гидротехнического строительства находят применение оболочки большого диаметра, занимающие
            промежуточное положение между защемленными в грунт тонкими стенками и массивными
            гравитационными сооружениями. Конструкция заполненной оболочки представляет собой тонкую
            оболочку (выполненную, как правило, из стали или железобетона) с внутренним наполнителем, в
            качестве которого используется грунт с заданными физическими и прочностными характеристиками.
            Отношение диаметра D к высоте конструкции H определяет группу оболочек большого диаметра, для которых указанное соотношение D/H находится в диапазоне от 0,7 до 1,0. Оболочки являются
            сравнительно выгодными экономически и позволяют в значительной мере учесть технологические
            возможности производителя строительных работ.
          </p>

          <p>
            По способу опирания на основание заполненные оболочки можно условно разделить на
            гравитационные, устанавливаемые на специально подготовленный слой прочного
            несжимаемого грунта («каменная постель»), и частично заглубленные в грунт.
          </p>

          <p>
            Нагрузки, воспринимаемые оболочками большого диаметра с наполнителем, условно могут
            быть представлены в виде горизонтальной и вертикальной равнодействующих, из которых первая
            (для длительно действующих нагрузок), как правило, включается в собственный вес конструкции, а
            вторая является наиболее критичной, вызывающей потерю устойчивости сооружения.
          </p>
        </div>
      </div>
      <div class="row" style="text-align: center">
        <div class="col-md-6">
          <nuxt-link to="/calc"><button class="btn btn-success">Перейти к расчету</button></nuxt-link>
        </div>
        <div class="col-md-6">
          <button class="btn">Перейти к построению графиков</button>
        </div>
      </div>
    </div>
  </section>
</template>


<style>
.base-container {
  min-height: 100vh;
  display: flex;
}
p {
  text-indent: 2vh;
  font-size: 2vh;
}
button {
  margin-top: 5px;
}
</style>
